0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet 
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
	    value		    uniform (0 0 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    inlet
    {
		type         uniformFixedValue; 
		uniformValue 
		{ 
		  type             tableFile; 
		  file             "/homes/caocd/OpenFOAM/bigDamRealSample/dataTable.txt"; 
		} 
    }

    fixedWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ramp
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
