0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    outlet 
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.1;
    }

    front 
    {
        type            empty;
    }

    back 
    {
        type            empty;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.1;
    }

    ground
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.1;
        value           uniform 0.1;
    }

    fixedWall  
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    ramp 
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
